quantummongolia/industrial-iot/esp32_firmware/pressfilter/src/main.cpp
/*
 * ============================================================
 *  ESP32-S3-Zero Шүүн шахах (pressfilter) → Firebase RTDB
 * ============================================================
 *
 *  3 тусдаа MAX485 transceiver, 3 бие даасан RS485 шугам (Modbus RTU @ 9600bps).
 *  MAX485 модуль бүрийн RO/DI/DE+RE → ESP GPIO холболт (DE+RE хооронд нь холбоно):
 *
 *   Bus A (UART1) — MAX485 #1:
 *     RO → GPIO 1 (RX) · DI → GPIO 2 (TX) · DE+RE → GPIO 3 · A/B → RS485 шугам #1
 *     Slave 1 : SPM33 — Десорбци ХС        (P, E)  → em09
 *     Slave 2 : SPM33 — Шүүн шахах УС       (P, E)  → em08
 *
 *   Bus B (UART2) — MAX485 #2:
 *     RO → GPIO 4 (RX) · DI → GPIO 5 (TX) · DE+RE → GPIO 6 · A/B → RS485 шугам #2
 *     Slave 3 : SPM33 — Нуруулдан уусгалт ХС (P, E) → em10
 *     (Компрессор ХС / em11 нь ushg ESP рүү шилжсэн — slave 3 болсон)
 *
 *   Bus C (UART0) — MAX485 #3:
 *     RO → GPIO 7 (RX) · DI → GPIO 8 (TX) · DE+RE → GPIO 9 · A/B → RS485 шугам #3
 *     Slave 5 : Supmea ultrasonic — Баян уусмалын сан (level, m)
 *     Slave 6 : Supmea ultrasonic — Цэвэр усан сан (level, m)
 *
 *   MAX485 бүрийн VCC / GND → ESP 3V3 / GND.  GPIO 21 — WS2812 onboard RGB LED.
 *
 *  Firebase RTDB:
 *    /energy_meters/em08..em10/{power_kw,total_energy_kwh}
 *    /pressfilter/bayan_tank/level, /pressfilter/clean_water_tank/level
 *    /pressfilter/last_updated
 */

#include "secrets.h"
#include "ota.h"
#include <Arduino.h>
#include <Firebase_ESP_Client.h>
#include <WiFi.h>
#include <addons/RTDBHelper.h>
#include <addons/TokenHelper.h>
#include <esp_task_wdt.h>

// ── Modbus тохиргоо ────────────────────────────────────────────────────
namespace cfg {
constexpr uint32_t BAUD = 9600;

// Bus A пинүүд (UART1) — 2× SPM33
constexpr uint8_t A_RX = 1, A_TX = 2, A_DE = 3;
// Bus B пинүүд (UART2) — 2× SPM33
constexpr uint8_t B_RX = 4, B_TX = 5, B_DE = 6;
// Bus C пинүүд (UART0) — 1× ultrasonic level
constexpr uint8_t C_RX = 7, C_TX = 8, C_DE = 9;

// Slave IDs (тус тусын bus дээр)
constexpr uint8_t EM09_SLAVE = 1; // Bus A — Десорбци ХС
constexpr uint8_t EM08_SLAVE = 2; // Bus A — Шүүн шахах УС
constexpr uint8_t EM10_SLAVE = 3; // Bus B — Нуруулдан уусгалт ХС
constexpr uint8_t ULS_SLAVE = 5;  // Bus C — Баян уусмалын сан (Supmea ultrasonic)
constexpr uint8_t ULS2_SLAVE = 6; // Bus C — Цэвэр усан сан (Supmea ultrasonic)

// SPM33 register addresses (4xxxx - 40001 = Modbus address)
constexpr uint16_t SPM33_REG_POWER = 10;   // 40011: Total active power LINT32, ×0.1 W
constexpr uint16_t SPM33_REG_ENERGY = 25;  // 40026: Total active energy LUINT32, ×0.1 kWh
constexpr uint16_t SPM33_REG_CT_PRI = 201; // 40202: CT primary side value (1..50000)
constexpr uint8_t SPM33_CT_SEC = 5;        // SPM33 CT secondary side (5A typical)

// Supmea ultrasonic level — Level instantaneous (uint16, raw/1000 = m)
constexpr uint16_t REG_ULS_LEVEL = 0x2002;
constexpr uint16_t REG_ULS_MOUNT = 0x2009; // Mount Height — суурилуулалтын нийт өндөр (raw/1000 = m, W/R)

constexpr uint32_t POLL_MS = 3000;                // Flow cycle interval (tick rate)
constexpr uint32_t TOTALIZER_INTERVAL_MS = 60000; // Totalizer cycle — 1 минут тутамд
constexpr uint32_t RX_TMO = 200;
constexpr uint32_t FRAME_GAP_MS = 10;

constexpr uint32_t WDT_TIMEOUT_S = 30;
constexpr uint32_t WIFI_RETRY_MS = 10000;
constexpr uint8_t MODBUS_RETRY = 2;
constexpr uint8_t MAX_CONSECUTIVE_FAILS = 10;
constexpr uint8_t MAX_RECOVERY_ATTEMPTS = 20;
// Connectivity watchdog: WiFi/Firebase энэ хугацаанаас удаан унавал болзолгүй
// ESP.restart() хийж сэргэнэ — while(true)+WDT-д найдахгүй сэргэлтийн гол баталгаа.
constexpr uint32_t MAX_OFFLINE_MS = 3UL * 60UL * 1000UL;  // 3 минут

// Long-running stability — flowmeter firmware-тэй ижил pattern
constexpr uint32_t MIN_FREE_HEAP_BYTES = 20480;                  // 20KB threshold
constexpr uint32_t MAX_UPTIME_MS = 24UL * 60UL * 60UL * 1000UL;  // 24 цаг
constexpr uint32_t HEAP_LOG_INTERVAL_MS = 5UL * 60UL * 1000UL;   // 5 минут тутам log
} // namespace cfg

// ── RGB STATUS LED (WS2812 GPIO 21 — Waveshare ESP32-S3-Zero onboard) ──
//   SLOW_RED — WiFi / Modbus / Firebase аль нэг нь алдсан үед удаан анивчина.
//   pulse()  — Firebase-д амжилттай upload болгонд нэг богино ногоон импульс.
namespace led {
constexpr uint8_t PIN = 21;
constexpr uint8_t BRIGHTNESS = 60;
constexpr uint16_t SLOW_ON_MS = 500;
constexpr uint16_t SLOW_OFF_MS = 500;
constexpr uint16_t PULSE_MS = 120;

inline void writeRGB(uint8_t r, uint8_t g, uint8_t b) {
  // Энэ board-ийн WS2812 чип нь R/G сувгуудыг солиод эмиттэр-лж байна.
  // Тиймээс r ба g-г солиод дамжуулна — дуудлагын талд "red"/"green" хэвээр.
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  rgbLedWrite(PIN, g, r, b);
#else
  neopixelWrite(PIN, g, r, b);
#endif
}

inline uint8_t scale(uint8_t v) { return (uint16_t(v) * BRIGHTNESS) / 255; }

enum Mode { OFF, SLOW_RED };
Mode mode = SLOW_RED;
unsigned long nextToggle = 0;
unsigned long pulseOffAt = 0;
bool on = false;

void begin() { writeRGB(0, 0, 0); }

void setMode(Mode m) {
  if (m == mode)
    return;
  mode = m;
  on = false;
  nextToggle = millis();
  if (m == OFF)
    writeRGB(0, 0, 0);
}

void pulse() {
  pulseOffAt = millis() + PULSE_MS;
  writeRGB(0, scale(255), 0);
}

void update() {
  unsigned long now = millis();

  if (pulseOffAt) {
    if (now < pulseOffAt)
      return;
    pulseOffAt = 0;
    writeRGB(0, 0, 0);
    on = false;
    nextToggle = now;
  }

  if (mode == OFF)
    return;

  if (now < nextToggle)
    return;
  if (on) {
    writeRGB(0, 0, 0);
    on = false;
    nextToggle = now + SLOW_OFF_MS;
  } else {
    writeRGB(scale(255), 0, 0); // SLOW_RED
    on = true;
    nextToggle = now + SLOW_ON_MS;
  }
}
} // namespace led

void ledTask(void *) {
  for (;;) {
    led::update();
    vTaskDelay(pdMS_TO_TICKS(20));
  }
}

// ── Modbus ─────────────────────────────────────────────────────────────
// Тус бүр өөрийн HardwareSerial (UART) болон DE/RE пинтэй — 3 bus-д 3 instance.
class Modbus {
public:
  Modbus(HardwareSerial &serial, uint8_t rx, uint8_t tx, uint8_t de)
      : _serial(serial), _rx(rx), _tx(tx), _de(de) {}

