quantummongolia/industrial-iot/esp32_firmware/pressfilter/src/main.cpp
  if (WiFi.status() != WL_CONNECTED &&
      now - lastWifiCheck >= cfg::WIFI_RETRY_MS) {
    lastWifiCheck = now;
    Serial.println("[WiFi] retry — async reconnect");
    WiFi.reconnect();
  }

  static unsigned long lastPoll = 0;
  if (now - lastPoll < cfg::POLL_MS)
    return;
  lastPoll = now;

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("[WiFi] not connected");
    led::setMode(led::SLOW_RED);
    return;
  }

  // Boot үед уншиж чадаагүй CT primary-уудыг дахин оролдох — нэг slave/cycle.
  if (!ctPrimaryKnown[cfg::EM09_SLAVE]) {
    Spm33_readCtPrimary(busA, cfg::EM09_SLAVE);
  } else if (!ctPrimaryKnown[cfg::EM08_SLAVE]) {
    Spm33_readCtPrimary(busA, cfg::EM08_SLAVE);
  } else if (!ctPrimaryKnown[cfg::EM10_SLAVE]) {
    Spm33_readCtPrimary(busB, cfg::EM10_SLAVE);
  }

  bool totalizerCycle = (lastTotalizerReadTime == 0) ||
                        (now - lastTotalizerReadTime >= cfg::TOTALIZER_INTERVAL_MS);

  Spm33Reading em08, em09, em10;
  uint16_t ulsRaw = 0;
  bool ulsLevelOk = false;
  float ulsLevel = 0.0f;
  uint16_t uls2Raw = 0;
  bool uls2LevelOk = false;
  float uls2Level = 0.0f;

  if (totalizerCycle) {
    // ── Totalizer cycle: 3× SPM33 энерги
    lastTotalizerReadTime = now;
    Serial.println("[Cycle] Totalizer read (1 min interval)");

    em09 = Spm33_readEnergy(busA, cfg::EM09_SLAVE);
    if (em09.energyOk) { cachedEm09EnergyKWh = em09.energyKWh; cachedEm09EnergyValid = true; }
    delay(cfg::FRAME_GAP_MS);
    em08 = Spm33_readEnergy(busA, cfg::EM08_SLAVE);
    if (em08.energyOk) { cachedEm08EnergyKWh = em08.energyKWh; cachedEm08EnergyValid = true; }
    delay(cfg::FRAME_GAP_MS);
    em10 = Spm33_readEnergy(busB, cfg::EM10_SLAVE);
    if (em10.energyOk) { cachedEm10EnergyKWh = em10.energyKWh; cachedEm10EnergyValid = true; }

    Serial.printf("[Totalizer] EM08:%s EM09:%s EM10:%s\n",
                  em08.energyOk ? String(em08.energyKWh, 1).c_str() : "#",
                  em09.energyOk ? String(em09.energyKWh, 1).c_str() : "#",
                  em10.energyOk ? String(em10.energyKWh, 1).c_str() : "#");
  } else {
    // ── Flow cycle: 3× SPM33 power + ultrasonic level
    em09 = Spm33_readPower(busA, cfg::EM09_SLAVE);
    delay(cfg::FRAME_GAP_MS);
    em08 = Spm33_readPower(busA, cfg::EM08_SLAVE);
    delay(cfg::FRAME_GAP_MS);
    em10 = Spm33_readPower(busB, cfg::EM10_SLAVE);
    delay(cfg::FRAME_GAP_MS);

    ulsLevelOk = withRetry(
        [&] { return busC.readU16(cfg::ULS_SLAVE, cfg::REG_ULS_LEVEL, ulsRaw); });
    ulsLevel = ulsLevelOk ? (ulsRaw / 1000.0f) : 0.0f;
    delay(cfg::FRAME_GAP_MS);
    uls2LevelOk = withRetry(
        [&] { return busC.readU16(cfg::ULS2_SLAVE, cfg::REG_ULS_LEVEL, uls2Raw); });
    uls2Level = uls2LevelOk ? (uls2Raw / 1000.0f) : 0.0f;

    // Mount height — савны нийт өндөр, тус бүр нэг л удаа (амжилттай болтол оролдоно).
    if (!ulsMountKnown) {
      uint16_t mountRaw = 0;
      if (withRetry([&] { return busC.readU16(cfg::ULS_SLAVE, cfg::REG_ULS_MOUNT, mountRaw); }) && mountRaw > 0) {
        ulsMountM = mountRaw / 1000.0f; ulsMountKnown = true;
        Serial.printf("[ULS] Bayan mount height: %.3f m\n", ulsMountM);
      }
    }
    if (!uls2MountKnown) {
      uint16_t mountRaw = 0;
      if (withRetry([&] { return busC.readU16(cfg::ULS2_SLAVE, cfg::REG_ULS_MOUNT, mountRaw); }) && mountRaw > 0) {
        uls2MountM = mountRaw / 1000.0f; uls2MountKnown = true;
        Serial.printf("[ULS] Clean-water mount height: %.3f m\n", uls2MountM);
      }
    }

    Serial.printf("[Flow] EM08:%s EM09:%s EM10:%s Bayan:%s Tseever:%s\n",
                  em08.powerOk ? String(em08.powerKW, 2).c_str() : "#",
                  em09.powerOk ? String(em09.powerKW, 2).c_str() : "#",
                  em10.powerOk ? String(em10.powerKW, 2).c_str() : "#",
                  ulsLevelOk ? String(ulsLevel, 3).c_str() : "#",
                  uls2LevelOk ? String(uls2Level, 3).c_str() : "#");
  }

  // ── Алдаа escalate ──────────────────────────────────────────────
  bool anyOk = em08.powerOk || em08.energyOk || em09.powerOk || em09.energyOk ||
               em10.powerOk || em10.energyOk ||
               ulsLevelOk || uls2LevelOk;
  if (anyOk) {
    consecutiveReadFails = 0;
    totalRecoveryAttempts = 0;
  } else {
    consecutiveReadFails++;
    if (consecutiveReadFails >= cfg::MAX_CONSECUTIVE_FAILS)
      recoverModbusBus();
  }

  // ── Firebase upload ────────────────────────────────────────────────
  if (!fbCanUpload()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!Firebase.ready()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!firebaseReady) {
    firebaseReady = true;
    Serial.println("[Firebase] ready");
    ota::begin(&fbData);
  }

  // ─ Subtree 1: /energy_meters/{em08..em10} ──────────────────────────
  bool emOk = true;
  bool emAny = false;
  {
    FirebaseJson j;
    auto addEm = [&](const char *id, const Spm33Reading &r, LiveState &lv) {
      String base = String(id) + "/";
      if (totalizerCycle) {
        if (r.energyOk) {
          j.set((base + "total_energy_kwh").c_str(), r.energyKWh);
          emAny = true;
        }
      } else {
        if (r.powerOk) {
          j.set((base + "power_kw").c_str(), liveValue(r.powerKW, lv));
          emAny = true;
        }
      }
    };
    addEm("em08", em08, lvEm08);
    addEm("em09", em09, lvEm09);
    addEm("em10", em10, lvEm10);
    if (emAny) {
      emOk = Firebase.RTDB.updateNodeSilent(&fbData, "/energy_meters", &j);
      if (!emOk)
        Serial.printf("[Firebase] /energy_meters ERROR: %s\n",
                      fbData.errorReason().c_str());
    }
  }

  // ─ Subtree 2: /pressfilter (ultrasonic level — flow cycle-д л) ──────
  bool pfOk = true;
  bool pfAny = false;
  {
    FirebaseJson j;
    if (!totalizerCycle) {
      if (ulsLevelOk)  { j.set("bayan_tank/level", liveValue(ulsLevel, lvBayan));        pfAny = true; }
      if (uls2LevelOk) { j.set("clean_water_tank/level", liveValue(uls2Level, lvClean)); pfAny = true; }
      // Mount height-г нэг удаа нийтэлнэ (амжилттай upload болтол оролдоно).
      if (ulsMountKnown && !ulsMountSent)   { j.set("bayan_tank/mount_height", ulsMountM);        pfAny = true; }
      if (uls2MountKnown && !uls2MountSent) { j.set("clean_water_tank/mount_height", uls2MountM); pfAny = true; }
      if (pfAny) j.set("last_updated", (int)(millis() / 1000));
    }
    if (pfAny) {
      pfOk = Firebase.RTDB.updateNodeSilent(&fbData, "/pressfilter", &j);
      if (!pfOk)
        Serial.printf("[Firebase] /pressfilter ERROR: %s\n",
                      fbData.errorReason().c_str());
    }
  }

  if (!emAny && !pfAny) {
    led::setMode(led::SLOW_RED);
    return;
  }

  if (emOk && pfOk) {
    Serial.println("[Firebase] Updated");
    fbOnSuccess();
    if (ulsMountKnown) ulsMountSent = true;   // mount height нийтлэгдсэн
    if (uls2MountKnown) uls2MountSent = true;
    led::setMode(led::OFF);
    led::pulse();
  } else {
    fbOnFailure();
    led::setMode(led::SLOW_RED);
  }

  ota::loop(&fbData, emOk && pfOk);
}
